#include "stdio.h"/*同构数是指一个数的平方的尾数等于该数本身。如：  
0^2 = 0 
1^2 =1
5^2 =25
从键盘上输入k，输出第k个同构数。 */ 
#include "math.h"
int main() 
{ 
    int k,a,i,count=0; 
 scanf("%d",&k); 
    for(i=0;1;i++) 
 { 
      a=i*i; 
     if(i<10) 
        { 
          if(a%10==i) 
            { 
              count++; 
           } 
      } 
      else if(i<100) 
      { 
          if((a%10==i%10)&&(a/10%10==i/10)) 
          { 
              count++; 
           } 
      } 
      else if(i<1000) 
     { 
          if((a%10==i%10)&&(a/10%10==i/10%10)&&(a/100%10==i/100)) 
            { 
              count++; 
           } 
      } 
      else if(i<10000) 
        { 
          if((a%10==i%10)&&(a/10%10==i/10%10)&&(a/100%10==i/100%10)&&(a/1000%10==i/1000)) 
            { 
              count++; 
           } 
      } 
      else if(i<100000) 
       { 
          if((a%10==i%10)&&(a/10%10==i/10%10)&&(a/100%10==i/100%10)&&(a/1000%10==i/1000%10)&&(a/10000%10==i/10000)) 
          { 
              count++; 
           } 
      } 
      if(count==k) 
       { 
          printf("%d^2=%d\n",i,a); 
           break; 
     } 
  } 
  return 0; 
}  
